<a href="https://colab.research.google.com/github/michalis0/BigScaleAnalytics/blob/master/week2/SQL_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Assignment - SQL

In [0]:
%load_ext sql
import pandas as pd
%sql sqlite://

### <font color = 'green'>World Cup Data</font>

In [0]:
# Load tables from CSV files
# Players
players_url = 'https://raw.githubusercontent.com/michalis0/BigScaleAnalytics/master/week2/data/Players.csv'
Players = pd.read_csv(players_url, index_col=0, encoding='utf-8')
%sql drop table if exists Players;
%sql persist Players
# Teams
teams_url = 'https://raw.githubusercontent.com/michalis0/BigScaleAnalytics/master/week2/data/Teams.csv'
Teams = pd.read_csv(teams_url, index_col=0, encoding='utf-8')
%sql drop table if exists Teams;
%sql persist Teams
# join Teams and Players
playersext_url = 'https://raw.githubusercontent.com/michalis0/BigScaleAnalytics/master/week2/data/PlayersExt.csv'
PlayersExt = pd.read_csv(playersext_url, index_col=0, encoding='utf-8')
%sql drop table if exists PlayersExt;
%sql persist PlayersExt

#### Look at sample of Players and Teams tables

In [0]:
%%sql
select * from Players limit 5

In [0]:
%%sql
select * from Teams limit 5

__PlayersExt__ table is simply the inner join of the __players__ and __Teams__ tables. Let's have a look at a sample of this table.

In [0]:
%%sql
select * from PlayersExt limit 5

#### <font color = 'green'>World Cup Basic Queries</font>

*1)  What player on a team with “ia” in the team name played less than 200 minutes and made more than 100 passes? Return the player surname and team. *

__Hint: To check if attribute A contains string S use "A like '%S%'" __

In [0]:
%%sql
select surname, team from Players where Players.team like '%ia%' AND Players.minutes < 200 
AND Players.passes > 100

*2) Find all players who made more than 20 shots. Return all player information in descending order of shots made.*

__Hint: SQL ordering syntax: "ORDER BY column1, column2, ... ASC|DESC" __

In [0]:
%%sql
select * from Players where Players.shots > 20 order by Players.shots desc

*3) Find the goalkeepers of teams that played more than four games. List the surname of the goalkeeper, the team, and the number of minutes the goalkeeper played.*

__Hint: You should use the joined data, `PlayersExt`__

In [0]:
%%sql
YOUR QUERY HERE

*4) How many players who play on a team with ranking <10 played more than 350 minutes? Return one number in a column named 'superstar'.*

__Hint: use "SELECT ... AS new_col_name" to rename a column__

In [0]:
%%sql
YOUR QUERY HERE

*5) What is the average number of passes made by forwards? By midfielders? Write one query that gives both values with the corresponding position.*

__Hint: use the GROUP BY clause__

__Hint: when selecting columns you can use AVG, SUM or COUNT clauses to calculate aggregates__

In [0]:
%%sql
YOUR QUERY HERE

*6) Which team has the highest average number of passes per minute played? Return the team and average passes per minute. *

__Hint 1: You can compute a team's average number of passes per minute played by dividing the total number of passes by the total number of minutes. To force floating point division, multiply one operand by 1.0. __

__Hint 2: Consider using Limit. __

In [0]:
%%sql
YOUR QUERY HERE

#### <font color = 'green'>World Cup Advanced Queries</font>

*1) Find all pairs of teams who have the same number of goalsFor as
each other and the same number of goalsAgainst as each other.
Return the teams and numbers of goalsFor and goalsAgainst.
Make sure to return each pair only once.*

__Hint: You basically need to do a self join of the Teams table. For that you need to join different name aliases of the Teams table. checkout [here](https://www.w3schools.com/sql/sql_join_self.asp) for help.__

In [0]:
%%sql
select A.team AS team_1, B.team AS team_2, A.goalsFor, A.goalsAgainst
from Teams A, Teams B
# complete the rest of the query

*2) Find all teams with ranking <30 where no player made more than 150 passes. Return the team and ranking.*

__Hint: use HAVING clause (documentation [here](https://www.w3schools.com/sql/sql_having.asp))__

In [0]:
%%sql
YOUR QUERY HERE

*3) Which team has the highest ratio of goalsFor to goalsAgainst?*

In [0]:
%%sql
YOUR QUERY HERE

*4) Find all teams whose defenders averaged more than 150 passes. Return the team and average number of passes by defenders, in descending order of average passes.*

__Hint: again you may use the HAVING clause here__

In [0]:
%%sql
YOUR QUERY HERE

### <font color = 'green'>Titanic Data</font>

In [0]:
# Load table from CSV file
with open('Titanic.csv','r') as f:
    Titanic = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Titanic;
%sql persist Titanic

#### Look at sample of Titanic table

In [0]:
%%sql
select * from Titanic limit 5

#### <font color = 'green'>Titanic Basic Queries</font>

*1) How many married women over age 50 embarked in Cherbourg? Note: To check if attribute A begins with string S use "A like 'S%'"*

In [0]:
%%sql
select count(*) from Titanic where Titanic.gender == 'F' 
AND Titanic.embarked like 'Cherbourg%'
AND Titanic.age > 50

*2) List the average fare paid by passengers in each of the embarkation cities (along with the city), in descending order of average fare.*

In [0]:
%%sql
YOUR QUERY HERE

*3) What's the most common last name among passengers?*

In [0]:
%%sql
YOUR QUERY HERE

*4) Write three queries: the total number of passengers; the number of passengers under 30; the number of passengers 30 or older. Why do the second and third numbers not add up to the first?*

In [0]:
%%sql
YOUR QUERY HERE

In [0]:
%%sql
YOUR QUERY HERE

In [0]:
%%sql
YOUR QUERY HERE

*5) Blanks in SQL tables are given a special value called 'null', and conditions 'A is null' and 'A is not null' can be used in Where clauses to check whether attribute A has the 'null' value. How many passengers don't have a value for age? Now do your numbers add up?*

In [0]:
%%sql
YOUR QUERY HERE

*6) For male survivors, female survivors, male non-survivors, and female non-survivors, how many passengers were in each of those four categories and what was their average fare paid?*

In [0]:
%%sql
YOUR QUERY HERE

#### <font color = 'green'>Titanic Advanced Queries</font>

*1) Are there any pairs of passengers with the same last name where one is in first class and the other is in third class? If so, return the last name and the two first names. Label the first-name columns 'first' for the passenger in first class and 'third' for the passenger in third class.*

In [0]:
%%sql
YOUR QUERY HERE

*2) Which embarkation cities have more than 40 passengers whose age is missing? Reminder: Blanks in SQL tables are given a special value called 'null', and conditions 'A is null' and 'A is not null' can be used in Where clauses to check whether attribute A has the 'null' value.*

In [0]:
%%sql
YOUR QUERY HERE

*3) Find all classes where the average fare paid by passengers in that class was more than twice the overall average or less than half the overall average.*

In [0]:
%%sql
YOUR QUERY HERE

*4) EXTRA CREDIT CHALLENGE: List each class and its survival rate, i.e., the fraction of passengers in that class who survived.*

In [0]:
%%sql
YOUR QUERY HERE

#### <font color = 'green'>Titanic Data Modification</font>

In [0]:
# Reload table from CSV file
# NOTE: You may want to reload frequently to reset the data as you
# experiment with modifications
with open('Titanic.csv','r') as f:
    Titanic = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Titanic;
%sql persist Titanic

*1) Subtract 5 from the fare paid by any passenger under the age of 10. Then compute the new average fare similar to question 2 in the previous section. NOTE: You can put two SQL statements in one cell separated by a semicolon.*

__Hint: use UPDATE and SET clauses to modify a column. [documentation](https://www.w3schools.com/sql/sql_update.asp)__

In [0]:
%%sql
UPDATE Titanic
set fare = fare - 5
where age < 10
;
select AVG(fare) as avg_fare, embarked 
from Titanic
GROUP BY embarked
ORDER BY avg_fare desc

*2) Create a new table called Survivors, containing the last and first names of all passengers who survived. Then count the number of tuples in the new table.*

__Hint: use the `CREATE TABLE` clause__

In [0]:
%%sql
drop table if exists Survivors;
CREATE TABLE Survivors AS
select first, last
from Titanic 
where survived = 'yes'
;
select COUNT(*) from Survivors

*3) In the Titanic table delete all but the passengers paid more than 300.*

__Hint: use the `DELETE FROM` clause__

*4) In what's left of the table after (3), insert a new tuple for yourself. You can decide your class, fare, where you embarked, and whether you survived. Then show the whole table.*

__Hint: use the `INSERT INTO` clause__